Revit 2026 API

# LightTypeSetLossFactor Method

---

Replace the current loss factor object with the given object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLossFactor(
	LossFactor lossFactor
)
```
```vb
Public Sub SetLossFactor (
	lossFactor As LossFactor
)
```
```cpp
public:
void SetLossFactor(
	LossFactor^ lossFactor
)
```
```fsharp
member SetLossFactor :
        lossFactor : LossFactor -> unit
```

#### Parameters

lossFactor LossFactor
     An object derived from a LossFactor object

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The argument object is cloned

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace